"You are about to delete your SSL Certificate" = "Vous êtes sur le point de créer un certificat SSL";"Cancel" = "Annuler";"You must provide more information to generate a certificate.
 Please make sure you complete the whole form properly." = "Vous devez fournir plus d'informations pour générer un certificat";"Your certificate will be remove from your system. Do you want to continue ?" = "Votre certificat sera détruit. Voulez-vous continuer ?";"Incomplete form" = "Formulaire incomplet";